package gov.milove;

import gov.milove.domain.CustomDate;
import gov.milove.domain.News;
import gov.milove.repositories.NewsRepository;
import org.junit.Test;
import org.junit.runner.RunWith;
import org.springframework.beans.factory.annotation.Autowired;
import org.springframework.boot.test.context.SpringBootTest;
import org.springframework.test.context.junit4.SpringRunner;

@RunWith(SpringRunner.class)
@SpringBootTest
public class NewsTest {

    @Autowired
    private NewsRepository newsRepo;

    @Test
    public void creatingNews() {
        for (int i = 0; i < 25; i++) {

            News news = new News();
            news.setDescription("Атестація народних аматорських колективів Миколаївської, Розвадівської територіальних громад");
            news.setImage_id("641ff32c4615df19b7d90ee1");
            news.setDate_of_creation(new CustomDate());
            news.setMain_text("26 березня 2023 року в приміщенні Миколаївського міського Палацу культури відбулась атестація художніх аматорських колективів Миколаївської, Тростянецької, Розвадівської територіальних громад.\n" +
                    " Перед численними глядачами виступили:\n" +
                    "\uD83D\uDD38 Народний аматорський жіночий хор «Пектораль» Миколаївського міського палацу культури.\n" +
                    "\uD83D\uDD38 Народний аматорський хор Народного дому с. Устя Миколаївської ТГ.\n" +
                    "\uD83D\uDD38 Народний аматорський вокальний ансамбль «Ліра» Народного дому с. Дроговиж Миколаївської ТГ.\n" +
                    "\uD83D\uDD38 Народний аматорський художньо-просвітницький колектив «Наддністрянка» Народного дому с. Рудники, Миколаївської ТГ.\n" +
                    "\uD83D\uDD38 Народний аматорський ансамбль народної музики Миколаївського міського палацу культури.\n" +
                    "\uD83D\uDD38 Зразковий аматорський танцювальний колектив «Семицвіт» Миколаївського міського Палацу культури.\n" +
                    "\uD83D\uDD38 Народний аматорський ансамбль сім’ї Верес Миколаївського міського Палацу культури.\n" +
                    "\uD83D\uDD38 Народний аматорський духовий оркестр Миколаївського міського Палацу культури.\n" +
                    "\uD83D\uDD38 Народна аматорська хорова капела Миколаївського міського Палацу культури.\n" +
                    "\uD83D\uDD38 Народний аматорський жіночий вокальний ансамбль «Калина» Миколаївського міського Палацу культури.\n" +
                    "\uD83D\uDD38 Народний аматорський вокально-інструментальний ансамбль «Сьоме небо» Миколаївського міського Палацу культури.\n" +
                    "\uD83D\uDD38 Народний аматорський ансамбль бандуристок «Етнодар» Миколаївського міського Палацу культури.\n" +
                    "\uD83D\uDD38 Народний аматорський вокальний ансамбль «Калинове намисто» працівників культури Тростянецької ТГ.\n" +
                    "\uD83D\uDD38 Народний аматорський хор Народного дому с. Демня Тростянецької ОТГ.\n" +
                    "\uD83D\uDD38 Народний аматорський вокальний ансамбль «Гердан» Народного дому с. Стільсько Тростянецької ТГ.\n" +
                    "\uD83D\uDD38 Народний аматорський хор Народного дому с. Розвадів Розвадівської ТГ.\n" +
                    "\uD83D\uDD38 Народний аматорський хор Народного дому с. Верин Розвадівської ТГ.\n" +
                    "\uD83D\uDD38 Народний аматорський ансамбль родини Мелешко Народного дому с. Київець Розвадівської ТГ.\n" +
                    "\uD83D\uDD38 Народний аматорський ансамбль сім’ї Гриців Народного дому с. Розвадів Розвадівської ТГ.\n" +
                    "\uD83D\uDD38 Аматорський хор «Червона калина» Народного дому с. Київець Розвадівської ТГ.\n" +
                    "Підтримати аматорські художні колективи своїх громад прийшли: голова Миколаївської міської ради Андрій Щебель та голова Розвадівської сільської ради Роман Сидор.\n" +
                    " Виступи народних аматорських колективів усіх трьох територіальної громад були справжнім джерелом радості та задоволення для глядачів. Ці колективи складаються з талановитих та завзятих людей, які займаються художньою творчістю на різних рівнях.\n" +
                    " У виступах колективів можна було побачити та почути різноманітні жанри мистецтва: від народного співу та танців до народної музики. Відтворення місцевих традицій та культури, історії та повсякденного життя у формі мистецтва завжди привертає увагу глядачів.\n" +
                    " Рішенням обласної атестаційної комісії усім колективам підтверджено звання «Народний» і «Зразковий» аматорський колектив.\n" +
                    " За високий художній рівень та виконавську майстерність Аматорський хор «Червона калина» Народного дому с. Київець Розвадівської ТГ рекомендовано до присвоєння звання «Народний аматорський колектив» .");

            newsRepo.save(news);
        }
    }
}
